[
    {
        "id": 1,
        "title":"The C Programming Language. 2nd Edition",
        "name": "K8S",
        "img": "https://sue.eu/wp-content/uploads/sites/6/2022/06/kubernetes-logo-920x460-sue-v0-800x400.png",
        "description": "안쿠버네티스(k8s 또는 큐브 라고도 함)는 컨테이너화된 애플리케이션을 배포, 관리, 확장할 때 수반되는 다수의 수동 프로세스를 자동화하는 오픈소스 컨테이너 오케스트레이션 플랫폼입니다. 원래 Google의 엔지니어 팀에서 Borg 프로젝트로 개발하고 설계한 쿠버네티스는 2015년에 CNCF(Cloud Native Computing Foundation)에 기부되었습니다. Red Hat®은 쿠버네티스가 출시되기 전부터 Google과 협력하여 개발에 참여한 초기 기업 중 하나였으며 쿠버네티스 업스트림 프로젝트에서 두 번째 주요 기여자가 되었습니다. ",
        "Author":"Book by Brian Kernighan and Dennis Ritchie"
    },
    {
        "id": 2,
        "title":"The C++ Programming Language",
        "name": "Docker",
        "img": "https://velog.velcdn.com/images/dnflekf2748/post/f2484388-0cf7-4624-98ea-c69b07fe03d0/docker-logo.png",
        "description": "컨테이너 기반 애플리케이션 구축 소프트웨어 플랫폼. 도커는 애플리케이션을 신속하게 구축, 테스트 및 배포할 수 있는 소프트웨어 플랫폼이다. 컨테이너에는 라이브러리, 시스템도구, 코드 등 소프트웨어 실행에 필요한 모든 것이 포함되어 있다. 즉, 도커를 통해 애플리케이션을 실행하면 독립적인 환경에서 일관된 결과를 보장한다. 소프트웨어를 실행할 때 OS와 라이브러리 의존성을 지니게 된다. 그래서 하나의 컴퓨터에 다른 버전의 런타임, 라이브러리를 실행 하려고 하면 관련 구성을 관리하기가 어렵다. 컨테이너는 개별 Software의 실행에 필요한 실행환경을 독립적으로 운용할 수 있도록 다른 실행환경과의 간섭을 막고 실행의 독립성을 확보해주는 운영체계 수준의 격리 기술이다.",
        "Author":" Danish computer scientist Bjarne Stroustrup"
    },
    {
        "id": 3,
        "title":"The C++ Programming Language",
        "name": "SonarQube",
        "img": "https://mblogthumb-phinf.pstatic.net/MjAxNjExMDhfMjU3/MDAxNDc4NTg1OTg2ODEy.9rfQBWmy0LX2h1hMPaXTmIvW0zVhcEL9zIRh-1ZdVKgg.Xnn4nbvO4S4A4yPYQTk6aQjxxoIVyYkYYd9S9rjILrQg.PNG.tmondev/sonarqube_logo_720.png?type=w800",
        "description": "소나큐브는 아키텍쳐와 설계, 코드 중복, 단위 테스트, 복잡도, 발생 가능한 잠재적인 버그, 코딩 규칙, 주석의 기준으로 프로젝트의 품질을 관리할 수 있는 오픈소스 정적 분석 도구입니다.",
        "Author":"Designed by: James Gosling"
    },
    {
        "id": 4,
        "name": "ArgoCD",
        "title":"Learn Python Programming",
        "img": "https://velog.velcdn.com/images/squarebird/post/e8d3b584-26f4-4a80-a159-19f3df327020/image.jpg",
        "description": "Argo CD란 GitOps스타일의 지속적인 배포(CD, Continuous Delivery / Continuous Deployment를 지원하는 도구입니다. Git Repository의 내용이 업데이트 되면 변경된 내용을 Kubernets 클러스터에 동기화시켜주는 방식으로 동작합니다. Argo CD는 Kubernetes와 같이 선언적으로 동작합니다. Git Repository의 특정 경로를 지정하고, 해당 경로에 원하는 Kubernetes의 상태가 기술된 manifest파일들을 위치시키면 Argo CD가 해당 파일에 선언한 상태들과 동일하게 Object들을 배포해줍니다.",
        "Author":"Designed by: Guido van Rossum"
    },
    {
        "id": 5,
        "name": "Jenkins",
        "title":"Net Framework languages",
        "img": "https://velog.velcdn.com/images/kakdark/post/f7d936b9-deb0-4b87-a605-d16381482e8f/image.webp",
        "description": "젠킨스란 소프트웨어 개발시 지속적인 통합(Continuous integration)을 제공해주는 도구이다. 더불어 지속적인 배포환경까지 구축할수 있는 도구 있다. 젠킨스와 같은 CI 도구들이 나오기전에는 일정시간동안 빌드를 실행하는 방식이 일반적이였다. 특히 개발자들이 당일 작성한 소스코드들이 커밋이 되는 심야 시간대에 이러한 빌드 타이머가 집중적으로 실행되었는데 이것을 Nightly-Build라고 한다. Jenkins는 빌드, 테스트, 배포 프로세스를 자동화하여 개발자의 시간 절약과 개발 생산성을 높일수 있다. 게다가 SVN,Git과 같은 버전관리 시스템과 연동하여 커밋을 감지하면 빌드가 작동되도록 설정도 할수 있다.",
        "Author":"Designed by: Anders Hejlsberg (Microsoft)"
    },
    {
        "id": 6,
        "name": "Prometheus",
        "title":"Learn HTML CSS",
        "img": "https://blog.kakaocdn.net/dn/bESGzl/btqTrRQs9Ir/C4VkptWwt7DPd6VCIFJO2k/img.png",
        "description": "Prometheus는 회사 등에서 쿠버네티스의 모니터링 시스템으로 사용하는 도구입니다. Prometheus는 SoundCloud사에서 만든 오픈소스 모니터링 툴로 go언어로 만들어졌으며, 지금은 독립된 오픈소스 프로젝트로 개발되고 있습니다. 쿠버네티스 환경에서 모니터링 하기 원하는 리소스로부터 metric을 수집하고 해당 매트릭으로 모니터링하는 기능을 제공합니다. 또한 수집 중 이상 징후가 발생 시 slack 및 도구를 통해 webhook을 걸어 알림을 주는 기능 또한 제공해주고 있습니다.",
        "Author":"Developed by: World Wide Web Consortium"
    },
    {
        "id": 7,
        "name": "Javascript",
        "title":"Learn Javascript",
        "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Unofficial_JavaScript_logo_2.svg/480px-Unofficial_JavaScript_logo_2.svg.png",
        "description": "Brendan Eich is an American computer programmer and technology executive. He created the JavaScript programming language and co-founded the Mozilla project, the Mozilla Foundation, and the Mozilla Corporation.Javascript is used by programmers across the world to create dynamic and interactive web content like applications and browsers. JavaScript is so popular that it's the most used programming language in the world, used as a client-side programming language by 97.0% of all websites.Both of these are computer languages that help in programming, but there is a major difference between JavaScript and HTML. While JavaScript (abbreviated as JS) is a scripting language, HTML is a markup language. We use HTML to create web pages or web applications.JavaScript simply adds dynamic content to websites to make them look good. HTML work on the look of the website without the interactive effects and all. HTML pages are static which means the content cannot be changed. It adds interactivity to web pages to make them look good.JavaScript is a simple and easy-to-learn programming language as compared to other languages such as C++, Ruby, and Python. It is a high-level, interpreted language that can easily be embedded with languages like HTML.",
        "Author":"Designed by: Brendan Eich "
    },
    {
        "id": 8,
        "name": "Bootstrap 5",
        "title":"Learn Bootstrap 5",
        "img": "https://getbootstrap.com/docs/5.2/assets/brand/bootstrap-social-logo.png",
        "description": "Bootstrap 5 is the newest version of Bootstrap, which is the most popular HTML, CSS, and JavaScript framework for creating responsive, mobile-first websites. Bootstrap 5 is completely free to download and use!Bootstrap 5 has officially landed! After three alphas, three betas, and several months of hard work, we're shipping the first stable release of our new major version.Bootstrap 5 (the current major version, released in May 2021) has brought with it tons of changes and improvements, including the addition of new components, new classes, new styling for old components, updated browser support, the removal of some old components, and much more.The grid system is responsive, and the columns will re-arrange automatically depending on the screen size.",
        "Author":"Daniel Charles Foreman"
    },
    {
        "id": 9,
        "name": "React JS",
        "title":"Learn React JS",
        "img": "https://programadoresbrasil.com.br/wp-content/uploads/2020/07/reactjs-logo-1-scaled.jpg",
        "description": "React is a free and open-source front-end JavaScript library for building user interfaces based on UI components. It is maintained by Meta and a community of individual developers and companies.React. js is an open-source JavaScript library that is used for building user interfaces specifically for single-page applications. It's used for handling the view layer for web and mobile apps. React also allows us to create reusable UI components.ReactJS is an open-source, component-based front-end library responsible only for the view layer of the application. It is maintained by Facebook.Both HTML and CSS are integral to any web development project. If you have these skills already, then learning React should be a relatively straightforward process. It has its own unique set of challenges, but it is an excellent tool to have in order to start or further your career as a web developer.",
        "Author":"React was originally created by Jordan Walke"
    },
    {
        "id": 10,
        "name": "Node JS",
        "title":"Learn Node JS",
        "img": "https://www.hubtech.org/wp-content/uploads/2021/10/The-Pros-and-Cons-of-Node.js-Web-App-Development.jpg",
        "description": "Node.js is an open-source, cross-platform, back-end JavaScript runtime environment that runs on the V8 engine and executes JavaScript code outside a web browser. Node. js is primarily used for non-blocking, event-driven servers, due to its single-threaded nature. It's used for traditional web sites and back-end API services, but was designed with real-time, push-based architectures in mind.A common misconception among developers is that Node. js is a backend framework and is only used for building servers. This isn't true: Node. js can be used both on the frontend and the backend.It's simpler than Java. It's ideal for full-stack developers. It offers faster and easier code writing. It has a node package manager, letting you store many libraries in one line.Javascript is a programming language that is used for writing scripts on the website. NodeJS is a Javascript runtime environment.",
        "Author":"Original author(s): Ryan Dahl"
    }
]